# 변수
# 값에 붙이는 이름

# π = 3.141592...

# 변수를 만드는 방법
# 식별자 = 값
# π = 3.141592

## 변수를 사용하는 방법
# print(π)

# 변수와 관련된 용어
# 정의(define): 변수를 만드는 행위 + 선언
# 할당(assign): 변수에 값을 넣는 행위
# 참조(reference): 변수 안에 있는 값을 사용하는 행위

# 정의와 할당
# pi = 3.141592 # 정의와 할당 동시
# pi = 3.14

# 복합 대입 연산자 
# a += 1

# pi = 3.141592
# 식별자 = 값[리터럴]
# pi = pi
# pi = pi + 1

## 예시 1
# a = 0
# print(a)
# a += 1 # a = a + 1
# print(a)
# a += 1
# print(a)
# a += 1
# print(a)
# a += 1
# print(a)

## 예시 2
string = "안녕하세요!" 
string += "!"
string += "!"
print(string)

## 형태
# [변수] [연산자] = [값]
# -> 변수에 값을 연산자해서 다시 변수에