# 숫자

## 정수
## 소수점이 없는 숫자
## 10, 273, 52 

## 부동소수점(floating point)
## 부동: 부유해서 움직인다.
## 소수점이 있는 숫자
## 10.1, 52.273, 52.0

# 숫자 연산자
# 덧셈: +
# 뺄셈: - 
# 나눗셈(몫): / -> 부동소수점으로 나옴
# 정수 나눗셈: // -> 정수로 나옴
# 나머지: %  -> 부동소수점으로 나옴
# 제곱: ** -> 부동소수점으로 나옴

# 정수 + 정수 
# = 정수 
# !예외: 나눗셈

# 부동소수점 + 부동소수점
# = 부동소수점

# 부동소수점 + 정수
# 정수 + 부동소수점
# = 부동소수점

# 문자열 + 정수 -> 불가능
# !예외: "반복" * 3

# 문자열 + 부동소수점 -> 불가능

# 연산자 우선순위
# * / >>> + -
# 2 + (2 * 2) = 2 + 4 = 6
# 2 + 2 * 2

# () 괄호연산자
# (): 계산이 먼저 일어나게 하는 기능
# (2 + 2) * 2 = 4 * 2 = 8
# 괄호를 사용하는 것이 좋음

# 제곱근
print(4 ** (1/2))
print(8 ** (1/3))
print(16 ** (1/4))